The solution is in the opposite direction of the connection direction.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SolutionIsOppositeToConnectionWarning { get; }
  Visual Basic
Public Shared ReadOnly Property SolutionIsOppositeToConnectionWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SolutionIsOppositeToConnectionWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace